Narin-Laboratory/libudawa-esp32/src/libudawa.h
    log_manager->info(PSTR(__func__),PSTR("Config loaded successfuly.\n"));
  }
  file.close();
}

void configSave()
{
  if(!SPIFFS.remove(configFile))
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to delete the old configFile: %s\n"), configFile);
  }
  File file = SPIFFS.open(configFile, FILE_WRITE);
  if (!file)
  {
    file.close();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;
  doc["name"] = config.name;
  doc["model"] = config.model;
  doc["group"] = config.group;
  doc["broker"] = config.broker;
  doc["port"]  = config.port;
  doc["wssid"] = config.wssid;
  doc["wpass"] = config.wpass;
  doc["dssid"] = config.dssid;
  doc["dpass"] = config.dpass;
  doc["upass"] = config.upass;
  doc["accTkn"] = config.accTkn;
  doc["provSent"] = config.provSent;
  doc["provDK"] = config.provDK;
  doc["provDS"] = config.provDS;
  doc["logLev"] = config.logLev;
  doc["gmtOff"] = config.gmtOff;

  doc["fIoT"] = config.fIoT;
  doc["fWOTA"] = config.fWOTA;
  doc["fIface"] = config.fIface;
  doc["hname"] = config.hname;
  doc["htU"] = config.htU;
  doc["htP"] = config.htP;

  doc["logIP"] = config.logIP;
  doc["logPrt"] = config.logPrt;

  serializeJson(doc, file);
  file.close();
}


void configCoMCUReset()
{
  SPIFFS.remove(configFileCoMCU);
  File file = SPIFFS.open(configFileCoMCU, FILE_WRITE);
  if (!file) {
    file.close();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;

  doc["fP"] = false;

  doc["bFr"] = 1600;
  doc["fB"] = 1;

  doc["pBz"] = 2;
  doc["pLR"] = 3;
  doc["pLG"] = 5;
  doc["pLB"] = 6;
  doc["lON"] = 0;

  serializeJson(doc, file);
  file.close();

  log_manager->info(PSTR(__func__),PSTR("ConfigCoMCU hard reset!"));
}

void configCoMCULoad()
{
  File file = SPIFFS.open(configFileCoMCU);
  StaticJsonDocument<DOCSIZE> doc;
  DeserializationError error = deserializeJson(doc, file);

  if(error)
  {
    file.close();
    configCoMCUReset();
    return;
  }
  else
  {

    if(doc["fP"] != nullptr){configcomcu.fP = doc["fP"].as<bool>();}
    if(doc["bFr"] != nullptr){configcomcu.bFr = doc["bFr"].as<uint16_t>();}
    if(doc["fB"] != nullptr){configcomcu.fB = doc["fB"].as<bool>();}
    if(doc["pBz"] != nullptr){configcomcu.pBz = doc["pBz"].as<uint8_t>();}
    if(doc["pLR"] != nullptr){configcomcu.pLR = doc["pLR"].as<uint8_t>();}
    if(doc["pLG"] != nullptr){configcomcu.pLG = doc["pLG"].as<uint8_t>();}
    if(doc["pLB"] != nullptr){configcomcu.pLB = doc["pLB"].as<uint8_t>();}
    if(doc["lON"] != nullptr){configcomcu.lON = doc["lON"].as<uint8_t>();}

    log_manager->info(PSTR(__func__),PSTR("ConfigCoMCU loaded successfuly.\n"));
  }
  file.close();
}

void configCoMCUSave()
{
  if(!SPIFFS.remove(configFileCoMCU))
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to delete the old configFileCoMCU: %s\n"), configFileCoMCU);
  }
  File file = SPIFFS.open(configFileCoMCU, FILE_WRITE);
  if (!file)
  {
    file.close();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;

  doc["fP"] = configcomcu.fP;

  doc["bFr"] = configcomcu.bFr;
  doc["fB"] = configcomcu.fB;

  doc["pBz"] = configcomcu.pBz;
  doc["pLR"] = configcomcu.pLR;
  doc["pLG"] = configcomcu.pLG;
  doc["pLB"] = configcomcu.pLB;
  doc["lON"] = configcomcu.lON;

  serializeJson(doc, file);
  file.close();
}

void syncConfigCoMCU()
{
  configCoMCULoad();

  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["fP"] = configcomcu.fP;
  doc["bFr"] = configcomcu.bFr;
  doc["fB"] = configcomcu.fB;
  doc["pBz"] = configcomcu.pBz;
  doc["method"] = "sCfg";
  serialWriteToCoMcu(doc, 0);
  doc.clear();
  doc["pLR"] = configcomcu.pLR;
  doc["pLG"] = configcomcu.pLG;
  doc["pLB"] = configcomcu.pLB;
  doc["lON"] = configcomcu.lON;
  doc["method"] = "sCfg";
  serialWriteToCoMcu(doc, 0);
  doc.clear();
}

bool loadFile(const char* filePath, char *buffer)
{
  File file = SPIFFS.open(filePath);
  if(!file || file.isDirectory()){
      file.close();
      return false;
  }
  uint16_t i = 0;
  while(file.available()){
    buffer[i] = file.read();
    i++;
  }
  buffer[i] = '\0';
  file.close();
  return true;
}

callbackResponse processProvisionResponse(const callbackData &data)
{
  tbKeeperLoop.setCallback(tbKeeperCb);
  log_manager->info(PSTR(__func__),PSTR("Received device provision response\n"));
  int jsonSize = measureJson(data) + 1;
  char buffer[jsonSize];
  serializeJson(data, buffer, jsonSize);

  if (strncmp(data["status"], "SUCCESS", strlen("SUCCESS")) != 0)
  {
    log_manager->warn(PSTR(__func__),PSTR("Provision response contains the error: %s\n"), data["errorMsg"].as<const char*>());
    return callbackResponse("provisionResponse", 1);
  }
  else
  {
    log_manager->info(PSTR(__func__),PSTR("Provision response credential type: %s\n"), data["credentialsType"].as<const char*>());
  }
  if (strncmp(data["credentialsType"], "ACCESS_TOKEN", strlen("ACCESS_TOKEN")) == 0)
  {
    log_manager->info(PSTR(__func__),PSTR("ACCESS TOKEN received: %s\n"), data["credentialsValue"].as<String>().c_str());
    strlcpy(config.accTkn, data["credentialsValue"].as<String>().c_str(), sizeof(config.accTkn));
    config.provSent = true;
    configSave();
  }
  if (strncmp(data["credentialsType"], "MQTT_BASIC", strlen("MQTT_BASIC")) == 0)
  {
    /*JsonObject credentials_value = data["credentialsValue"].as<JsonObject>();
    credentials.client_id = credentials_value["clientId"].as<String>();
    credentials.username = credentials_value["userName"].as<String>();
    credentials.password = credentials_value["password"].as<String>();
    */
  }
  reboot();
  return callbackResponse("provisionResponse", 1);
}

void serialWriteToCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc, bool isRpc)
{
  serializeJson(doc, Serial2);
  StringPrint stream;
  serializeJson(doc, stream);
  String result = stream.str();
  log_manager->debug(PSTR(__func__),PSTR("Sent to CoMCU: %s\n"), result.c_str());
  if(isRpc)
  {
    delay(50);
    doc.clear();
    serialReadFromCoMcu(doc);
  }
}

void serialReadFromCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc)
{
  StringPrint stream;
  String result;
  ReadLoggingStream loggingStream(Serial2, stream);
  DeserializationError err = deserializeJson(doc, loggingStream);
  result = stream.str();
  if (err == DeserializationError::Ok)
  {
    log_manager->debug(PSTR(__func__),PSTR("Received from CoMCU: %s\n"), result.c_str());
  }
  else
  {
    log_manager->debug(PSTR(__func__),PSTR("Serial2CoMCU DeserializeJson() returned: %s, content: %s\n"), err.c_str(), result.c_str());
    return;
  }
}


void readSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path)
{
  File file = SPIFFS.open(path);
  DeserializationError error = deserializeJson(doc, file);

  if(error)
  {
    file.close();
    return;
  }
  file.close();
}

void writeSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path)
{
  SPIFFS.remove(path);
  File file = SPIFFS.open(path, FILE_WRITE);
  if (!file)
  {
    file.close();
    return;
  }
  serializeJson(doc, file);
  file.close();
}

void setCoMCUPin(uint8_t pin, uint8_t op, uint8_t mode, uint16_t aval, uint8_t state)
{
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sPin";
  params["pin"] = pin;
  params["mode"] = mode;
  params["op"] = op;
  params["state"] = state;
  params["aval"] = aval;
  serialWriteToCoMcu(doc, false);
}

double round2(double value) {
   return (int)(value * 100 + 0.5) / 100.0;
}

const uint32_t MAX_INT = 0xFFFFFFFF;
uint32_t micro2milli(uint32_t hi, uint32_t lo)
{
  if (hi >= 1000)
  {
    log_manager->warn(PSTR(__func__), PSTR("Cannot store milliseconds in uint32!\n"));
  }

  uint32_t r = (lo >> 16) + (hi << 16);
  uint32_t ans = r / 1000;
  r = ((r % 1000) << 16) + (lo & 0xFFFF);
  ans = (ans << 16) + r / 1000;

  return ans;
}


static SemaphoreHandle_t udpSemaphore = NULL;
void ESP32UDPLogger::log_message(const char *tag, LogLevel level, const char *fmt, va_list args)
{
    if((int)level > config.logLev || !WiFi.isConnected()){
      return;
    }
    if(udpSemaphore == NULL)
    {
        udpSemaphore = xSemaphoreCreateMutex();
    }

    if(udpSemaphore != NULL && xSemaphoreTake(udpSemaphore, (TickType_t) 20))
    {
        int size = 512;
        WiFiUDP udp;
        char data[size];
        vsnprintf(data, size, fmt, args);
        String msg = String(get_error_char(level)) + "~[" + config.name + "] " + String(tag) + "~" + String(data);
        
        udp.beginPacket(config.logIP, config.logPrt);
        udp.write((uint8_t*)msg.c_str(), msg.length());
        udp.endPacket();

        xSemaphoreGive(udpSemaphore);
    }
    else{
        printf("Could not get UDP semaphore.\n");
    }
}

} // namespace libudawa
#endif